name: "Comparison operators"
version: ">= 1.0"

variables:
  # True when LHS is strictly smaller than RHS.
  lt:
  - "!="
  - "<"
  - "<="

  # True when LHS is strictly bigger than RHS.
  gt:
  - "!="
  - ">"
  - ">="

  # False when LHS is equal to RHS.
  eq:
  - "=="
  - ">="
  - "<="

  # False when LHS is equal to RHS.
  ne:
  - "!="
  - "<"
  - ">"

  op:
  - "<"
  - "<="
  - ">"
  - ">="

  bool:
  - "true"
  - "false"

  # These are considered "unordered"
  un:
  - "{}"
  - "null"
  - "[]"

tests:
- name: "Invalid"
  result: null
  variables:
    op: ['<', '<=', '>', '>=']
    expr:
    - 'a[].b'
    - 'a[].b[]'
    num: 42
  tests:
  - query: '~num~ ~op~ ~expr~'
  - query: '~expr~ ~op~ ~num~'

- name: "Numbers"
  result: true
  tests:
  - query: '1 ~eq~ 1'
  - query: '1 ~lt~ 2'
  - query: '2 ~gt~ 1'
  - query: '1 ~ne~ 1'
    result: false

- name: "Boolean"
  result: true
  variables:
    true: "true"
    false: "false"
  tests:
  - query: '~true~ ~gt~ ~false~'
  - query: '~false~ ~lt~ ~true~'
  - query: '~true~ ~eq~ ~true~'
  - query: '~false~ ~eq~ ~false~'
  - query: '~false~ ~ne~ ~false~'
    result: false

- name: "Strings"
  result: true
  variables:
    a: '"a"'
    b: '"b"'
    ab: '"ab"'
  tests:
  - query: '~a~ ~eq~ ~a~'
  - query: '~a~ ~lt~ ~b~'
  - query: '~a~ ~lt~ ~ab~'
  - query: '~b~ ~gt~ ~a~'
  - query: '~ab~ ~gt~ ~a~'
  - query: '~a~ ~ne~ ~a~'
    result: false

- name: "Datetimes"
  result: true
  variables:
    a: '"2020-01-01T12:00:00Z"'
    a2: '"2020-01-01T13:00:00+01:00"'
    b: '"2020-01-01T12:00:00.001Z"'
    c: '"2020-01-01T13:00:00Z"'
  tests:
  - query: 'dateTime(~a~) ~eq~ dateTime(~a~)'
  - query: 'dateTime(~a2~) ~eq~ dateTime(~a~)'
  - query: 'dateTime(~a~) ~lt~ dateTime(~c~)'
  - query: 'dateTime(~b~) ~gt~ dateTime(~a~)'
  - query: 'dateTime(~a~) ~ne~ dateTime(~a~)'
    result: false

- name: "Datetimes against strings"
  result: null
  variables:
    a: '"2020-01-01T12:00:00Z"'
    b: '"2020-01-01T13:00:00Z"'
  tests:
  - query: 'dateTime(~a~) ~op~ ~b~'
  - query: '~a~ ~op~ dateTime(~b~)'

- name: "Mixed types"
  result: null
  tests:
  - query: '1 ~op~ "1"'
  - query: '1 ~op~ ~bool~'
  - query: '1 ~op~ ~un~'
  - query: '"1" ~op~ ~bool~'
  - query: '"1" ~op~ ~un~'
  - query: '~bool~ ~op~ ~un~'
  - query: '~un~ ~op~ ~un~'
