name: "dateTime() function"

tests:
- name: "Basic"
  query: |
    dateTime("2002-10-02T12:34:56Z")
  result: "2002-10-02T12:34:56Z"

- name: "Basic with idempotency"
  query: |
    dateTime(dateTime("2002-10-02T12:34:56Z"))
  result: "2002-10-02T12:34:56Z"

- name: "Fractional seconds"
  query: |
    dateTime("2002-10-02T12:34:56.001Z")
  result: "2002-10-02T12:34:56.001Z"

- name: "Invalid format"
  query: |
    dateTime("2002-10-02 12:34:56Z")
  result: null

- name: "With time offset"
  query: |
    dateTime("2002-10-02T12:34:56+01:00")
  result: "2002-10-02T11:34:56Z"

- name: "Normalizes to zulu"
  query: |
    dateTime("2002-10-02T12:34:56+00:00")
  result: "2002-10-02T12:34:56Z"

- name: "Unknown types"
  variables:
    expr:
    - '123'
    - '[1, 2]'
    - '{"key": "value"}'
    - '(1 => 2)'
    - '(1 .. 3)'
    - 'null'
    - 'true'
    - 'false'
  query: |
    dateTime(~expr~)
  result: null

- name: "Incorrect number of arguments"
  valid: false
  tests:
  - query: 'dateTime()'
  - query: 'dateTime(1, 2, 3)'
  - query: 'dateTime(1, 2, 3, 4)'