name: "math::max() function"

version: ">= 1.1"

documents:
- _id: "a"
  _type: "doc"
  value: 1
  values: [1, 2, 3]
- _id: "b"
  _type: "doc"
  value: 22
  values: [4, 5, 6]
- _id: "c"
  _type: "doc"
  value: 99
  values: [7, 8, 9]
- _id: "d"
  _type: "doc"
  value: -3
  values: []
- _id: "e"
  _type: "ref"
  values:
    - _ref: "a"
    - _ref: "b"
    - _ref: "c"
    - _ref: "d"

tests:
- name: All numbers
  query: |
    math::max([1, 2, 3])
  result: 3

- name: Null among numbers
  query: |
    math::max([1, 2, 3, 4, null])
  result: 4

- name: Empty
  query: |
    math::max([])
  result: null

- name: Non-numbers
  query: |
    math::max(~val~)
  variables:
    val:
    - '[1, 2, 3, 4, null, "hello", true]'
    - "[null]"
    - "[\"hello\"]"
    - "[true]"
    - "[[2]]"
  result: null

- query: |
    math::max(*[_type == "doc"].value)
  result: 99

- query: |
    math::max(*[_type == "doc"].values[])
  result: 9

- name: "Max of references"
  query: |
    *[_type == "ref"] {
      "max": math::max(values[]->value)
    }[0].max
  result: 99
