name: "math::avg() function"

version: ">= 1.1"

documents:
- _id: "a"
  _type: "doc"
  value: 1
  values: [1, 2, 3]
- _id: "b"
  _type: "doc"
  value: 22
  values: [4, 5, 6]
- _id: "c"
  _type: "doc"
  value: 99
  values: [7, 8, 9]
- _id: "d"
  _type: "doc"
  value: -3
  values: []
- _id: "e"
  _type: "ref"
  values:
    - _ref: "a"
    - _ref: "b"
    - _ref: "c"
    - _ref: "d"

tests:
- name: All numbers
  query: |
    math::avg([1, 2, 3, 4])
  result: 2.5

- name: Null among numbers
  query: |
    math::avg([1, 2, 3, 4, null])
  result: 2.5

- name: Empty
  query: |
    math::min([])
  result: null

- name: Non-numbers
  query: |
    math::min(~val~)
  variables:
    val:
    - '[1, 2, 3, 4, null, "hello", true]'
    - "[null]"
    - "[\"hello\"]"
    - "[true]"
    - "[[2]]"
  result: null

- query: |
    math::avg(*[_type == "doc"].value)
  result: 29.75

- query: |
    math::avg(*[_type == "doc"].values[])
  result: 5

- name: "Avg of references"
  query: |
    *[_type == "ref"] {
      "avg": math::avg(values[]->value)
    }[0].avg
  result: 29.75
